//1) დავწეროთ ფუნქცია რომელსაც გადეცემა რაიმე პარამეტრი და არგუმენტად
//მიიღებს ისეთ რიცხვებს რომლის დახმარებითაც უნდა გამოვითვალო
//მაგალითად რამდენი წელი გვაკლდება თითოეულს პენსიამდე და ეს
//ყველაფერი უნდა დავწეროთ ამ ფუნქციაში.

//2)შექმენით კალკულატორის ფუნქცია სახელად კალკულატორი,
// რომელიც ასრულებს ძირითად არითმეტიკულ ოპერაციებს.
// ამ ფუნქციამ უნდა მიიღოს სამი პარამეტრი: ორი რიცხვი და სტრიქონი,მაგალითად num1,num2, "+".
// რომელიც წარმოადგენს არითმეტიკულ ოპერატორს ('+', '-', '*', '/').
// მოწოდებული ოპერატორის მიხედვით, ფუნქციამ უნდა შეასრულოს შესაბამისი ოპერაცია ორ ნომერზე და დააბრუნოს შედეგი.

//3)შეიმუშავეთ ფუნქცია სახელწოდებით checkPasswordStrength, რომელიც აფასებს მოცემული პაროლის სიძლიერეს.
// პაროლის სიძლიერე განისაზღვრება რამდენიმე კრიტერიუმის საფუძველზე: ის უნდა იყოს მინიმუმ 8 სიმბოლო და მაქსიმუმ 16 სიმბოლო;
// ფუნქციამ უნდა დააბრუნოს სტრიქონი სადაც გვეწერება რომ თუ ნაკლებია 8 მაშინ შესაბამისი ერორით თუ მეტია 16 მაშინ შესაბამისი ერრორით და თუ ცარიელია input უნდა შევამოწმოთ ეგეც
//გამოიყენეთ if-else განცხადებები თითოეული კრიტერიუმის შესამოწმებლად და სიძლიერის შესაფასებლად.

//4) დაწერეთ ფუქნცია სადაც პარამეტრად გავატანთ flowers და არგუმენტად გავატანთ ყვავილების სახეობებს.
//და გვჭირდება რომ switch case დავწეროთ ლოგიკა რომ თუ შესაბამისი სახელის ყვავილები გვაქვს მაშინ დავაბრუნოთ console-ში 
//ეს ყვავილი ნაპოვნია!!

//5)გვჭირდება სამი prompt.გვჭირდება რომ ამ სამ ინფუტში შემოყვანილი რიცხვებიდან რომელი არის უდიდესი ის დავიჭიროთ და დავლოგოთ უბრალოდ.
// მაგალითად.2,5,7 და აქედან უდიდესი არის 7.
//დაწერეთ ფუნქციაში ეს ყველაფერი და შემდეგ ამ ფუნქციაში შეამოწმეთ if else დახმარებით!!




 //1

// function myfunction(age,limit){
//     if (age >= limit){
//         console.log("თქვენ საპენსიო ასაკში ხართ")
//     }
//     else if (age < limit){
//         let pens = limit - age
//         console.log(`თქვენ გაკლიათ პენსიამდე ${pens} წელი`)
//     }
// }
// myfunction(60,60)






//2

// function Calculator(num1,num2,operation){
//     if (operation == '+'){
//         console.log(num1 + num2)
//     }
//     else if (operation == '-'){
//         console.log(num1 - num2)
//     }
//     else if (operation == '*'){
//         console.log(num1 * num2)
//     }else if (operation == '/'){
//         console.log(num1 / num2)
//     }
// }
// Calculator(5,3,'*')









//3

// function checkPasswordStrength(password){
//     if( password.length > 16 || password.length < 8){
//         console.log('თქვენი პაროლი უნდა იყოს 8 სიმბოლოზე მეტი და 16 სიმბოლოზე ნაკლები')
//     }
//     else if(password.length <= 16 && password.length >= 8){
//         console.log('თქვენი პაროლი ძლიერია')
//     }
//     else{
//         console.log('გთხოვთ შეიყვანეთ პაროლი')
//     }
// }
// checkPasswordStrength('დეზოქსირიბონუკლეინის მჟავა')






//4



// function myfunction(flower){
//     switch (flower) {
//         case 'ვარდი':
//             console.log('ვარდი ნაპოვნია')
            
//             break;
//             case 'ტიტა':
//             console.log('ტიტა ნაპოვნია')
            
//             break;
//             case 'ია':
//             console.log('ია ნაპოვნია')
            
//             break;
//             case 'იასამანი':
//             console.log('იასამანი ნაპოვნია')
            
//             break;
//             case 'ენძელა':
//             console.log('ენძელა ნაპოვნია')
            
//             break;
    
//         default:
//             console.log('ყვავილი არ არის ნაპოვნი')
//             break;
//     }

// }
// myfunction('ენძელა')







//5
// let num1 = prompt('პირველი რიცხვი')
// let num2 = prompt('მეორე რიცხვი')
// let num3 = prompt('მესამე რიცხვი')

// function MyFunction() {
//     if (num1 > num2 && num1 > num3) {
//         console.log(`უმაღლეს რიცხვია ${num1}`);
//     } else if (num2 > num1 && num2 > num3) {
//         console.log(`უმაღლეს რიცხვია ${num2}`);
//     }
//      else if (num3 > num1 && num3 > num2){
//         console.log(`უმაღლესი რიცხვია ${num3}`)
//      }
   
// }
// MyFunction();